openwrt-client.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-03-12 Sun 00:13 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>openwrt client mode</title>
<meta name="generator" content="Org Mode" />
<meta charset="UTF-8">
<nav>
<a href="index.html">home</a> /
<a href="about.html">about</a> /
<a href="sitemap.html">sitemap</a> /
</nav>
</head>
<body>
<div id="content" class="content">
<h1 class="title">openwrt client mode</h1>
<p>
client mode is sort of like bridge mode, but it creates a little NAT.
</p>

<div id="outline-container-org000000b" class="outline-2">
<h2 id="org000000b"><span class="section-number-2">1.</span> whiterussian (0.9)</h2>
<div class="outline-text-2" id="text-1">
<p>
it should be noted that this openwrt version has known
vulnerabilities, and should not be used if you are able to use a newer
version.
</p>

<p>
instructions a mix of the stuff from <a href="https://ram.squat.net/tech/openwrt/whiterussian_client_setup.html">squat.net</a> and <a href="https://oldwiki.archive.openwrt.org/oldwiki/wirelessbridgewithwpahowto">openwrt's oldwiki</a>,
but modified to get it to work
</p>
</div>

<div id="outline-container-org0000000" class="outline-3">
<h3 id="org0000000"><span class="section-number-3">1.1.</span> ssh</h3>
<div class="outline-text-3" id="text-1-1">
<p>
the crypto algorithms are so old, modern versions of openssh no longer
accept them by default.
</p>

<p>
use these options to allow these insecure algorithms them
</p>
<pre class="example" id="org0000000">
ssh -oKexAlgorithms=+diffie-hellman-group1-sha1 -oHostKeyAlgorithms=+ssh-rsa -c aes256-cbc root@openwrt
</pre>
</div>
</div>

<div id="outline-container-org0000006" class="outline-3">
<h3 id="org0000006"><span class="section-number-3">1.2.</span> setup</h3>
<div class="outline-text-3" id="text-1-2">
</div>
<div id="outline-container-org0000001" class="outline-4">
<h4 id="org0000001"><span class="section-number-4">1.2.1.</span> installing necessary packages</h4>
<div class="outline-text-4" id="text-1-2-1">
<p>
the package repository for whiterussian has moved to the <a href="https://archive.openwrt.org/whiterussian/0.9/packages/">openwrt's
archive subdomain</a>.
</p>

<p>
from the <code>non-free</code> subdirectory you will need:
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">package</th>
<th scope="col" class="org-left">reason</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>wl</code></td>
<td class="org-left">tool for connecting to wifi on broadcom chips</td>
</tr>

<tr>
<td class="org-left"><code>nas</code></td>
<td class="org-left">support for WPA on broadcom chips</td>
</tr>
</tbody>
</table>

<p>
and other packages you will also need:
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">package</th>
<th scope="col" class="org-left">reason</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>ip</code></td>
<td class="org-left">iproute2 stuff</td>
</tr>

<tr>
<td class="org-left"><code>kmod-brcm-wl</code></td>
<td class="org-left">stuff for <code>wl</code></td>
</tr>

<tr>
<td class="org-left"><code>dhcp-forwarder</code></td>
<td class="org-left">dhcp relaying</td>
</tr>

<tr>
<td class="org-left"><code>wificonf</code></td>
<td class="org-left">replacement for wlconf</td>
</tr>

<tr>
<td class="org-left"><code>libpthread</code></td>
<td class="org-left">needed as a dependency for some stuff</td>
</tr>
</tbody>
</table>

<p>
if you are tempted by the <code>asterisk</code> package, just know that it seems
to have compatibility issues with modern SIP phones.
</p>

<p>
to send these package files to openwrt, you can use scp with these
options:
</p>
<pre class="example" id="org0000001">
scp -O -oKexAlgorithms=+diffie-hellman-group1-sha1 -oHostKeyAlgorithms=+ssh-rsa -c aes256-cbc *.ipk root@openwrt
</pre>
</div>
</div>

<div id="outline-container-org0000002" class="outline-4">
<h4 id="org0000002"><span class="section-number-4">1.2.2.</span> nvram</h4>
<div class="outline-text-4" id="text-1-2-2">
<p>
wait a few seconds before booting, so that you can reset it if
necessary
</p>
<pre class="example" id="org0000002">
nvram set boot_wait=on
</pre>

<p>
enable routed client mode. the 'true' bridging modes do not seem to
work on modern networks.
</p>
<pre class="example" id="org0000002">
nvram set wl0_mode=sta
</pre>

<p>
set which ports go where
</p>
<pre class="example" id="org0000002">
nvram set lan_ifnames='vlan0 eth2 eth3'
nvram set wan_ifname=eth1
</pre>

<p>
various network details
</p>
<pre class="example" id="org0000002">
nvram set wl0_ssid='meow' # ssid to autoconnect to
nvram set wl0_wpa_psk='hunter2'
nvram set wl0_channel=1
nvram set lan_ipaddr=192.168.3.1
</pre>
</div>
</div>

<div id="outline-container-org0000003" class="outline-4">
<h4 id="org0000003"><span class="section-number-4">1.2.3.</span> add route</h4>
<div class="outline-text-4" id="text-1-2-3">
<pre class="example" id="org0000003">
echo 'route add default gw 192.168.1.1 eth1' &gt; /etc/init.d/S98route
chmod +x /etc/init.d/S98route
</pre>
</div>
</div>

<div id="outline-container-org0000004" class="outline-4">
<h4 id="org0000004"><span class="section-number-4">1.2.4.</span> save your work</h4>
<div class="outline-text-4" id="text-1-2-4">
<pre class="example" id="org0000004">
nvram commit
</pre>
</div>
</div>

<div id="outline-container-org0000005" class="outline-4">
<h4 id="org0000005"><span class="section-number-4">1.2.5.</span> scan alias</h4>
<div class="outline-text-4" id="text-1-2-5">
<pre class="example" id="org0000005">
echo 'alias scan="wl scan ; sleep 1 ; wl scanresults"' &gt;&gt; /etc/profile
</pre>
</div>
</div>
</div>

<div id="outline-container-org000000a" class="outline-3">
<h3 id="org000000a"><span class="section-number-3">1.3.</span> connecting to wifi</h3>
<div class="outline-text-3" id="text-1-3">
</div>
<div id="outline-container-org0000007" class="outline-4">
<h4 id="org0000007"><span class="section-number-4">1.3.1.</span> iwconfig</h4>
<div class="outline-text-4" id="text-1-3-1">
<p>
<code>iwconfig</code> can be used to view your connection status
</p>
</div>
</div>

<div id="outline-container-org0000008" class="outline-4">
<h4 id="org0000008"><span class="section-number-4">1.3.2.</span> scan</h4>
<div class="outline-text-4" id="text-1-3-2">
<p>
use the <a href="#org0000005">previously defined</a> <code>scan</code> alias to scan for wifi networks
</p>
</div>
</div>

<div id="outline-container-org0000009" class="outline-4">
<h4 id="org0000009"><span class="section-number-4">1.3.3.</span> wl</h4>
<div class="outline-text-4" id="text-1-3-3">
<p>
use <code>wl join</code> to connect to a network
</p>
<pre class="example" id="org0000009">
wl join meow key 'hunter2' amode wpapsk
</pre>

<p>
or an open one
</p>
<pre class="example" id="org0000009">
wl join meow
</pre>
</div>
</div>
</div>
</div>
</div>
</body>
</html>
